Reports/бит_НаправлениеДляПостановкиНаВоинскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>бит_НаправлениеДляПостановкиНаВоинскийУчет</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНаправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВоенныйКомиссариат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганФМС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОрганыФМС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийДеньС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийДеньПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбедС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбедПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриемныеДни</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеприемныеДни</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКабинетаОфицераЗапаса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКабинетаПрапорщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКабинетаПризывника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/бит_НаправлениеДляПостановкиНаВоинскийУчет/Ext/ObjectModule.bsl
#Область ФормированиеОтчета

Процедура СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, Схема = Неопределено, ВыводитьПолностью = Истина, АдресХранилища) Экспорт
	
	Результат.Очистить();
	Результат.ТолькоПросмотр = Истина;
	Результат.ЧерноБелаяПечать = Истина;
	Результат.КлючПараметровПечати = "ПараметрыПечати_НаправлениеДляПостановкиНаВоинскийУчет";
	
	Если ТипЗнч(Схема) = Тип("Строка") Тогда
		Если ЭтоАдресВременногоХранилища(Схема) Тогда
			СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(Схема);
		КонецЕсли;
	Иначе
		СхемаКомпоновкиДанных = Схема;
	КонецЕсли;
	
	КомпоновщикНастроек.Восстановить();
	
	Если ЗначениеЗаполнено(Период) Тогда
		
		бит_ОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Период"     , КонецДня(Период));
		
	КонецЕсли;

	бит_ОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ФизЛицо"     , ФизЛицо);
	
	НастройкиДляКомпоновкиМакета = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиДляКомпоновкиМакета,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКД.Инициализировать(МакетКомпоновки,,, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ДеревоРезультат = Новый ДеревоЗначений;
	ПроцессорВывода.УстановитьОбъект(ДеревоРезультат);
	ПроцессорВывода.Вывести(ПроцессорКД);
	
	Макет = ПолучитьМакет("Макет");
	ОбластьЛицеваяСторона = Макет.ПолучитьОбласть("ЛицеваяСторона");
	
	СтрокаДереваЗначений = ДеревоРезультат.Строки[0];
	ОбластьЛицеваяСторона.Параметры.НомерНаправления = НомерНаправления;
	
	ФИО = СтрокаДереваЗначений.Фамилия + " " + СтрокаДереваЗначений.Имя + " " + СтрокаДереваЗначений.Отчество;
	
	ФИО1 = "";
	ФИО2 = "";
	Если ЗначениеЗаполнено(ФИО) Тогда
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ФИО, 30, ФИО1, ФИО2);
		ОбластьЛицеваяСторона.Параметры.ФИО1 = ФИО1;
		ОбластьЛицеваяСторона.Параметры.ФИО2 = ФИО2;
	КонецЕсли;	
	ЗаполнитьЗначенияСвойств(ОбластьЛицеваяСторона.Параметры, СтрокаДереваЗначений);
	ОбластьЛицеваяСторона.Параметры.ДатаРождения = Формат(СтрокаДереваЗначений.ДатаРождения,"ДЛФ=Д") + " г.";
	ОбластьЛицеваяСторона.Параметры.СерияПаспорта = СтрокаДереваЗначений.ДокументСерия;
	ОбластьЛицеваяСторона.Параметры.НомерПаспорта = СтрокаДереваЗначений.ДокументНомер;
	Выдан = СтрокаДереваЗначений.ДокументКемВыдан;
	Выдан1 = "";
	Выдан_2 = "";
	Выдан2 = "";
	Выдан3 = "";
	Если ЗначениеЗаполнено(Выдан) Тогда
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Выдан, 20, Выдан1, Выдан_2);
		ОбластьЛицеваяСторона.Параметры.ПаспортВыдан1 = Выдан1;
		Если ЗначениеЗаполнено(Выдан_2) Тогда
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Выдан_2, 30, Выдан2, Выдан3);
			ОбластьЛицеваяСторона.Параметры.ПаспортВыдан2 = Выдан2;
			ОбластьЛицеваяСторона.Параметры.ПаспортВыдан3 = Выдан3;
		КонецЕсли;
	КонецЕсли;
	ОбластьЛицеваяСторона.Параметры.ДатаВыдачи = Формат(СтрокаДереваЗначений.ДокументДатаВыдачи,"ДЛФ=Д") + " г.";
	ОбластьЛицеваяСторона.Параметры.КодПодразделения = СтрокаДереваЗначений.ДокументКодПодразделения;
	Контрагент = ВоенныйКомиссариат;
	Контрагент1 = "";
	Контрагент_2 = "";
	Контрагент2 = "";
	Контрагент3 = "";
	Если ЗначениеЗаполнено(Контрагент) Тогда
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Контрагент, 30, Контрагент1, Контрагент_2);
		ОбластьЛицеваяСторона.Параметры.ВоенныйКомиссариат1 = Контрагент1;
		Если ЗначениеЗаполнено(Контрагент_2) Тогда
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(Контрагент_2, 30, Контрагент2, Контрагент3);
			ОбластьЛицеваяСторона.Параметры.ВоенныйКомиссариат2 = Контрагент2;
			ОбластьЛицеваяСторона.Параметры.ВоенныйКомиссариат3 = Контрагент3;
		КонецЕсли;
	КонецЕсли;
	
	Город = СтрокаДереваЗначений.Поле2;
	
	Если Город = "" Тогда
		Город = СтрокаДереваЗначений.Поле4;
	Иначе
		Город = Город + ", " + СтрокаДереваЗначений.Поле4;
	КонецЕсли;
	Если Город = "" Тогда
		Город = СтрокаДереваЗначений.Поле5;
	Иначе
		Город = Город + ", " + СтрокаДереваЗначений.Поле5;
	КонецЕсли;
	Город = ?(СтрокаДереваЗначений.Поле2 = "","",СтрокаДереваЗначений.Поле2);
	
	
	// БИТ_ЖКХ 31.10.2014
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ПроживающиеКонтактнаяИнформация.Ссылка,
	//|	бит_ПроживающиеКонтактнаяИнформация.ПредставлениеЗапятые,
	|	бит_ПроживающиеКонтактнаяИнформация.Тип,
	|	бит_ПроживающиеКонтактнаяИнформация.Вид
	|ИЗ
	|	Справочник.бит_Проживающие.КонтактнаяИнформация КАК бит_ПроживающиеКонтактнаяИнформация
	|ГДЕ
	|	бит_ПроживающиеКонтактнаяИнформация.Ссылка = &ФизЛицо";
	
	Запрос.УстановитьПараметр("ФизЛицо", СтрокаДереваЗначений.ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Отбор = Новый Структура();
	Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ФактАдресПроживающего);
	
	СтрокиФактАдресПроживающего = СтрокаДереваЗначений.ФизЛицо.КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	Отбор = Новый Структура();
	Отбор.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ЮрАдресПроживающего);
	
	СтрокиЮрАдресПроживающего = СтрокаДереваЗначений.ФизЛицо.КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если НЕ СтрокиФактАдресПроживающего.количество() = 0 Тогда
			//6.12.2018
			Если ЗначениеЗаполнено(СтрокиФактАдресПроживающего[0].Представление) Тогда
				
				//6.12.2018
				ФактАдресПредставление = СтрокиФактАдресПроживающего[0].Представление;
				СтруктураФактАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ФактАдресПредставление);
				
				//6.12.2018
				если  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтруктураФактАдрес, "Регион") = истина тогда 				

				  Если СтруктураФактАдрес.Регион = "Москва г" и СтруктураФактАдрес.Город = "" Тогда
					
					СтруктураФактАдрес.Город = "Москва г";
					
				  КонецЕсли;
				  
				конецесли;
				
			КонецЕсли;
			
		ИначеЕсли НЕ СтрокиЮрАдресПроживающего.количество() = 0 Тогда
			
			//6.12.2018
			Если ЗначениеЗаполнено(СтрокиЮрАдресПроживающего[0].Представление) Тогда
				
				ЮрАдресПредставление = СтрокиЮрАдресПроживающего[0].Представление;
				СтруктураФактАдрес = бит_УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ЮрАдресПредставление);
				
				//6.12.2018
				если  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтруктураФактАдрес, "Регион") = истина тогда 				

				  Если СтруктураФактАдрес.Регион = "Москва г" и СтруктураФактАдрес.Город = "" Тогда
					
					СтруктураФактАдрес.Город = "Москва г";
					
				  КонецЕсли;
				  
				конецесли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	 //6.12.2018	
	Если ЗначениеЗаполнено(СтруктураФактАдрес) и 
		  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтруктураФактАдрес, "Город") = истина и
		   ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтруктураФактАдрес, "Улица") = истина и
		    ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтруктураФактАдрес, "Дом") = истина и
		     ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтруктураФактАдрес, "Корпус") = истина и
			  ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтруктураФактАдрес, "Квартира") = истина Тогда
		МестоЖительства =  Строка(СтруктураФактАдрес.Город) + ", " + Строка(СтруктураФактАдрес.Улица) + ", дом № " + Строка(СтруктураФактАдрес.Дом) + ", корп. № " + Строка(СтруктураФактАдрес.Корпус) + ", кв. № " + Строка(СтруктураФактАдрес.Квартира);
	Иначе
		МестоЖительства =  Город + ", " + Строка(СтрокаДереваЗначений.Улица) + ", дом № " + Строка(СтрокаДереваЗначений.НомерДома) + ", корп. № " + Строка(СтрокаДереваЗначений.Корпус) + ", кв. № " + Строка(СтрокаДереваЗначений.Квартира);
	КонецЕсли;

	// БИТ_ЖКХ 31.10.2014
	
	МестоЖительства1 = "";
	МестоЖительства_2 = "";
	МестоЖительства2 = "";
	МестоЖительства3 = "";
	Если ЗначениеЗаполнено(МестоЖительства) Тогда
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(МестоЖительства, 18, МестоЖительства1, МестоЖительства_2);
		ОбластьЛицеваяСторона.Параметры.МестоЖительства1 = МестоЖительства1;
		Если ЗначениеЗаполнено(МестоЖительства_2) Тогда
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(МестоЖительства_2, 30, МестоЖительства2, МестоЖительства3);
			ОбластьЛицеваяСторона.Параметры.МестоЖительства2 = МестоЖительства2;
			ОбластьЛицеваяСторона.Параметры.МестоЖительства3 = МестоЖительства3;
		КонецЕсли;
	КонецЕсли;
	АдресВоенногоКомиссариата = бит_УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(ВоенныйКомиссариат, "Фактический");
	// БИТ_ЖКХ 22.09.2015 10:08:19 Начало правки... 
	Если СтрДлина(АдресВоенногоКомиссариата) > 35 Тогда
		АдресВоенногоКомиссариата1 = "";
		АдресВоенногоКомиссариата2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(АдресВоенногоКомиссариата, 17, АдресВоенногоКомиссариата1, АдресВоенногоКомиссариата2);
		ОбластьЛицеваяСторона.Параметры.АдресВоенногоКомиссариата1 = АдресВоенногоКомиссариата1;
		ОбластьЛицеваяСторона.Параметры.АдресВоенногоКомиссариата2 = АдресВоенногоКомиссариата2;
	Иначе
		ОбластьЛицеваяСторона.Область("R16C46:R17C82").Объединить();
		ОбластьЛицеваяСторона.Область("R16C46:R17C82").ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
		ОбластьЛицеваяСторона.Область("R16C46:R17C82").ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
		ОбластьЛицеваяСторона.Параметры.АдресВоенногоКомиссариата = АдресВоенногоКомиссариата;
	КонецЕсли;
	//ОбластьЛицеваяСторона.Параметры.АдресВоенногоКомиссариата = АдресВоенногоКомиссариата;
	// БИТ_ЖКХ 22.09.2015 10:08:15 Конец правки. 
	ОрганФМС3 = ОрганФМС;
	ОрганФМС1 = "";
	ОрганФМС2 = "";
	Если ЗначениеЗаполнено(ОрганФМС3) Тогда
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ОрганФМС3, 50, ОрганФМС1, ОрганФМС2);
		ОбластьЛицеваяСторона.Параметры.ОрганФМС1 = ОрганФМС1;
		ОбластьЛицеваяСторона.Параметры.ОрганФМС2 = ОрганФМС2;
	КонецЕсли;
	ФИОДолжность = СокрЛП(бит_ПаспортныйСтолСервер.ПолучитьСокращенноеФИО(ФИОЛица, Период) + " " + ДолжностьЛица);
	ОбластьЛицеваяСторона.Параметры.ФИОДолжность = ФИОДолжность;
	ОбластьЛицеваяСторона.Параметры.ДатаОтчета = Формат(Период,"ДФ=""дд ММММ гггг 'г.'""");
	
	ОбластьЛицеваяСторона.Параметры.НачалоРаботыВРабочиеДни = Лев(Формат(РабочийДеньС,"ДЛФ=T"),СтрДлина(Формат(РабочийДеньС,"ДЛФ=T"))-3);
	
	ОбластьЛицеваяСторона.Параметры.ОкончаниеРаботыВРабочиеДни = Лев(Формат(РабочийДеньПо,"ДЛФ=T"),СтрДлина(Формат(РабочийДеньПо,"ДЛФ=T"))-3);
	
	ОбластьЛицеваяСторона.Параметры.НачалоОбеда = Лев(Формат(ОбедС,"ДЛФ=T"),СтрДлина(Формат(ОбедС,"ДЛФ=T"))-3);
	
	ОбластьЛицеваяСторона.Параметры.ОкончаниеОбеда = Лев(Формат(ОбедПо,"ДЛФ=T"),СтрДлина(Формат(ОбедПо,"ДЛФ=T"))-3);
	
	ОбластьЛицеваяСторона.Параметры.ПриемныеДни = ПриемныеДни;
	ОбластьЛицеваяСторона.Параметры.НеприемныеДни = НеприемныеДни;
	ОбластьЛицеваяСторона.Параметры.КабинетПриемаОфицеровЗапаса = НомерКабинетаОфицераЗапаса;
	ОбластьЛицеваяСторона.Параметры.КабинетПриемаПрапорщиков = НомерКабинетаПрапорщика;
	ОбластьЛицеваяСторона.Параметры.КабинетПриемаПризывников = НомерКабинетаПризывника;
	Результат.Вывести(ОбластьЛицеваяСторона);
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти
